### From Pandas to SQL - **delete**

*by @italomarcelogit*

In [10]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('dados/db1.db')
c = conn.cursor()
# select
c.execute('select * from pessoas')
df = pd.DataFrame(
    c.fetchall(),
    columns=['id_pessoa', 'nome', 'idade', 'situacao'])

df

   id_pessoa     nome  idade  situacao
0          1      Ana     30         1
1          2    Maria     88        -1
2          3  Barbara     27         1

In [11]:
df.drop(index=1, inplace=True)
df

   id_pessoa     nome  idade  situacao
0          1      Ana     30         1
2          3  Barbara     27         1

In [12]:
df.to_sql('pessoas', conn, index=False, if_exists='replace')

2